bootstrap/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.page(params[:page]).per(5)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = 1 LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = 1
---
  def show
    @article = Article.find(params[:id])
    @comments = Comment.where(article_id: @article).page(params[:page]).per(5)