bootstrap/app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "content", "article_id") VALUES (?, ?, ?)  [["author", "Sylva"], ["content", "1er comment pour l'article 1"], ["article_id", 1]]
---
    def create
        Comment.create author: params[:author], content: params[:content], article_id: params[:id]